vernamlab/ECE2049-STM32-Adafruit-Graphics-Library/Releases/v1.1/Library/Core/Inc/graphics/Adafruit_ST7735_API.h
/**
 * @file Adafruit_ST7735_API.cpp
 * @author Kyle Schmottlach (kjschmottlach@wpi.edu)
 * @brief This is the source code implementing the API defined for the Adafruit ST7735 TFT display driver chip. This API is declared in Adafruit_ST7735_API.h 
 *        and is intended to be used as a C-style wrapper around the C++ Adafruit_ST7735 class, allowing for easier integration with C code. The functions in 
 *        this file simply call the corresponding methods of the Adafruit_ST7735 class instance, which is stored in a global handle struct. This class is
 *        intended to be used with the 1.8" TFT shield variant used within the ECE 2049 course, and is entirely self-contained
 * @version 1.0
 * @date 2026-03-07
 * 
 * @copyright Copyright (c) 2026
 * 
 */

#ifndef ADAFRUIT_ST7735_API_H
#define ADAFRUIT_ST7735_API_H

#include "stdint.h"
#include "stm32h5xx_hal.h"
#include "stdbool.h"

#include "Adafruit_ST7735_Macros.h"
#include "Adafruit_ST77xx_Macros.h"
#include "gfxfont.h"
#include "stm32h5xx_hal_spi.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

/**
 * @brief Internal handle used to store the instance of an Adafruit_ST7735 class for use in the C API functions. This struct is not 
 *        intended to be used outside of this API and should be treated as an opaque handle. Provides a C compatible structure to store 
 *        the C++ class instance for the ST7735 display.
 * 
 */
typedef struct ST7735_Handle ST7735_Handle;

//---------------------------------------------------------------------------------
// Adafruit_ST7735.cpp function declarations

/**
 * @brief Function used to create the instance for the display's graphics
 * 
 * @param spi_handle The handle for the STM32 hardware spi instance that has been set up for the TFT display
 * @param cs The pin number for the TFT display's CS pin. Will come from a macro with the pin label generated by STM32CubeMX
 * @param cs_port The STM32 GPIO port for the TFT display's CS pin. Predefined macro for the GPIO port associated with the CS pin
 * @param dc The pin number for the TFT display's DC pin. Will come from a macro with the pin label generated by STM32CubeMX
 * @param dc_port The STM32 GPIO port for the TFT display's DC pin. Predefined macro for the GPIO port associated with the DC pin
 */
void Display_create(SPI_HandleTypeDef *spi_handle, int16_t cs, GPIO_TypeDef *cs_port, int16_t dc, GPIO_TypeDef *dc_port);

/**
 * @brief Function used to initialize the display using the given options
 * 
 * @param options One of the preset Adafruit INITR intialization options presets. Can be found in Adafruit_ST7735_Macros.h
 */
void Display_init(uint8_t options);

/**
 * @brief Function to change rotation of display
 * 
 * @param m How many 90 degree turns to apply to the display. 0 is no change, 1 rotates clockwise by 90 degrees, 2 clockwise 180 degrees, and 3 clockwise 270 degrees
 */
void Display_setRotation(uint8_t m);
//---------------------------------------------------------------------------------
// Adafruit_ST77xx.cpp function declarations

/**
 * @brief Sets the address windows that the display expects to receive data in from another function call. Typically not used as singleton
 * 
 * @param x Starting x pixel
 * @param y Starting y pixel
 * @param w Width of window
 * @param h Height of window
 */
void Display_setAddrWindow(uint16_t x, uint16_t y, uint16_t w, uint16_t h);

/**
 * @brief Turns the display on or off
 * 
 * @param enable True turns the display on, false turns the display off
 */
void Display_enableDisplay(bool enable);

/**
 * @brief Enables a display tearing correction pin. Unused on the TFT 1.8" display
 * 
 * @param enable True turns enables tearing correct, false disables tearing correction
 */
void Display_enableTearing(bool enable);

/**
 * @brief Enables whether the display should be able to enter sleep mode when given a command. Not typically used
 * 
 * @param enable True enables sleeping, flase disables sleeping
 */
void Display_enableSleep(bool enable);

//---------------------------------------------------------------------------------
// Adafruit_SPITFT.cpp function declarations

/**
 * @brief Draws a single pixel with a color to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x X coord of the pixel
 * @param y Y coord of the pixel
 * @param color Color to set the pixel
 */
void Display_drawPixel(int16_t x, int16_t y, uint16_t color);

/**
 * @brief Fills a rectangle on the display with a color. Singleton function that automatically calls setAddrWindow
 * 
 * @param x X coord of the top left corner of the rectangle
 * @param y Y coord of the top left corner of the rectangle
 * @param w Width of the rectangle
 * @param h Height of the rectangle
 * @param color Color to fill the rectangle with. In the (565) bit RGB format
 */
void Display_fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);

/**
 * @brief Optimized horizontal line drawing function. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Starting x coord for the line
 * @param y The y coord to draw the line on
 * @param w The width of the line
 * @param color Color to draw the line in
 */
void Display_drawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color);

/**
 * @brief Optimized vertical line drawing function. Singleton function that automatically calls setAddrWindow
 * 
 * @param x X coord to draw the line on
 * @param y Starting y coord for the line
 * @param h Height of the line
 * @param color Color to draw the line in
 */
void Display_drawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color);

/**
 * @brief Function to invert the display colors. Singleton function that automatically calls setAddrWindow
 * 
 * @param i True inverts the display, false sets the display to normal colors
 */
void Display_invertDisplay(bool i);

/**
 * @brief Converts 8-bit R, G, and B values into a single 16-bit value in 565 RGB format
 * 
 * @param r 8-bit red value
 * @param g 8-bit green value
 * @param b 8-bit blue value
 * @return uint16_t 16-bit color value in 565 RGB format
 */
uint16_t Display_color565(uint8_t r, uint8_t g, uint8_t b);

/**
 * @brief Function to draw an RGB bitmap to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Starting x coord to draw the bitmap at the top left corner
 * @param y Starting y coord to draw the bitmap at the top left corner
 * @param pcolors Pointer to the bitmap data in an array of 16-bit color values in 565 RGB format
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 */
void Display_drawRGBBitmap(int16_t x, int16_t y, uint16_t *pcolors, int16_t w, int16_t h);

/**
 * @brief Function to draw an RGB bitmap to the display with an optional mask. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Starting x coord to draw the bitmap at the top left corner
 * @param y Starting y coord to draw the bitmap at the top left corner
 * @param pcolors Pointer to the bitmap data in an array of 16-bit color values in 565 RGB format
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param mask Pointer to the mask data in an array of 8-bit values
 */
void Display_drawRGBBitmapMask(int16_t x, int16_t y, uint16_t *pcolors, int16_t w, int16_t h, uint8_t *mask);

//---------------------------------------------------------------------------------
// Adafruit_GFX.cpp function declarations

/**
 * @brief Function to fill the entire screen with a single color. Singleton function that automatically calls setAddrWindow
 * 
 * @param color Color to fill the screen with
 */
void Display_fillScreen(uint16_t color);

/**
 * @brief Function to draw a line between two points. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Starting x coord of the line
 * @param y0 Starting y coord of the line
 * @param x1 Ending x coord of the line
 * @param y1 Ending y coord of the line
 * @param color Color of the line
 */
void Display_drawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color);

/**
 * @brief Function to draw a non-filled rectangle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Starting x coord of the rectangle
 * @param y Starting y coord of the rectangle
 * @param w Width of the rectangle
 * @param h Height of the rectangle
 * @param color Color of the rectangle
 */
void Display_drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);

/**
 * @brief Function to draw a non-filled circle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the circle
 * @param y0 Center y coord of the circle
 * @param r Radius of the circle
 * @param color Color of the circle
 */
void Display_drawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color);

/**
 * @brief Function to draw a circle that you can choose the corner to draw. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the circle
 * @param y0 Center y coord of the circle
 * @param r Radius of the circle
 * @param cornername Corner of the circle to draw. Mask bit #1, #2, #4, and #8 to indicate which quarters of the circle should be drawn
 * @param color Color of the circle
 */
void Display_drawCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, uint16_t color);

/**
 * @brief Function to draw a filled circle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the circle
 * @param y0 Center y coord of the circle
 * @param r Radius of the circle
 * @param color Color of the circle
 */
void Display_fillCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color);

/**
 * @brief Function to draw a filled circle that you can choose the corner to draw. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the circle
 * @param y0 Center y coord of the circle
 * @param r Radius of the circle
 * @param cornername Corner of the circle to draw. Mask bit #1, #2, #4, and #8 to indicate which quarters of the circle should be drawn
 * @param delta Offset from the circle's radius
 * @param color Color of the circle
 */
void Display_fillCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, int16_t delta, uint16_t color);

/**
 * @brief Function to draw a non-filled ellipse. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the ellipse
 * @param y0 Center y coord of the ellipse
 * @param rw Radius along the x-axis
 * @param rh Radius along the y-axis
 * @param color Color of the ellipse
 */
void Display_drawEllipse(int16_t x0, int16_t y0, int16_t rw, int16_t rh, uint16_t color);

/**
 * @brief Function to draw a filled ellipse. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Center x coord of the ellipse
 * @param y0 Center y coord of the ellipse
 * @param rw Radius along the x-axis
 * @param rh Radius along the y-axis
 * @param color Color of the ellipse
 */
void Display_fillEllipse(int16_t x0, int16_t y0, int16_t rw, int16_t rh, uint16_t color);

/**
 * @brief Function to draw a non-filled triangle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 First vertex x coord of the triangle
 * @param y0 First vertex y coord of the triangle
 * @param x1 Second vertex x coord of the triangle
 * @param y1 Second vertex y coord of the triangle
 * @param x2 Third vertex x coord of the triangle
 * @param y2 Third vertex y coord of the triangle
 * @param color Color of the triangle
 */
void Display_drawTriangle(int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color);

/**
 * @brief Function to draw a filled triangle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 First vertex x coord of the triangle
 * @param y0 First vertex y coord of the triangle
 * @param x1 Second vertex x coord of the triangle
 * @param y1 Second vertex y coord of the triangle
 * @param x2 Third vertex x coord of the triangle
 * @param y2 Third vertex y coord of the triangle
 * @param color Color of the triangle
 */
void Display_fillTriangle(int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color);

/**
 * @brief Draws a rounded non-filled rectangle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Top-left corner x coord of the rectangle
 * @param y0 Top-left corner y coord of the rectangle
 * @param w Width of the rectangle
 * @param h Height of the rectangle
 * @param radius Radius of the rounded corners
 * @param color Color of the rectangle
 */
void Display_drawRoundRect(int16_t x0, int16_t y0, int16_t w, int16_t h, int16_t radius, uint16_t color);

/**
 * @brief Draws a filled rounded rectangle. Singleton function that automatically calls setAddrWindow
 * 
 * @param x0 Top-left corner x coord of the rectangle
 * @param y0 Top-left corner y coord of the rectangle
 * @param w Width of the rectangle
 * @param h Height of the rectangle
 * @param radius Radius of the rounded corners
 * @param color Color of the rectangle
 */
void Display_fillRoundRect(int16_t x0, int16_t y0, int16_t w, int16_t h, int16_t radius, uint16_t color);

/**
 * @brief Draws a monochrome bitmap to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param color Color to draw the bitmap
 */
void Display_drawBitmap(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h, uint16_t color);

/**
 * @brief Draws a monochrome bitmap with a background color to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param color Color to draw the bitmap
 * @param bg Background color of the bitmap
 */
void Display_drawBitmapBg(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h, uint16_t color, uint16_t bg);

/**
 * @brief Draws an XBM format bitmap exported from GIMP to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param color Color to draw the bitmap
 */
void Display_drawXBitmap(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h, uint16_t color);

/**
 * @brief Draws an XBM format bitmap exported from GIMP to the display with a background color. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param color Color to draw the bitmap
 */
void Display_drawXBitmapBg(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h, uint16_t color, uint16_t bg);

/**
 * @brief Draws a grayscale bitmap to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 */
void Display_drawGrayscaleBitmap(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h);

/**
 * @brief Draws a grayscale bitmap with a mask to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the bitmap
 * @param y Top-left corner y coord of the bitmap
 * @param bitmap Pointer to the bitmap data
 * @param w Width of the bitmap
 * @param h Height of the bitmap
 * @param mask Pointer to the mask data (1=bit mask where 1 is set and 0 is clear)
 */
void Display_drawGrayscaleBitmapMask(int16_t x, int16_t y, uint8_t *bitmap, int16_t w, int16_t h, uint8_t *mask);

/**
 * @brief Draws a character to the display. Singleton function that automatically calls setAddrWindow
 * 
 * @param x Top-left corner x coord of the character
 * @param y Top-left corner y coord of the character
 * @param c Character to draw
 * @param color Color of the character
 * @param bg Background color of the character
 * @param size_x Horizontal scaling factor
 * @param size_y Vertical scaling factor
 */
void Display_drawChar(int16_t x, int16_t y, unsigned char c, uint16_t color, uint16_t bg, uint8_t size_x, uint8_t size_y);

/**
 * @brief Gets the bounding box of a string of text. Used to determine how much space a string of text will take up on the display. Singleton function that does not call setAddrWindow
 * 
 * @param string Pointer to the string of text
 * @param x Top-left corner x coord of the text
 * @param y Top-left corner y coord of the text
 * @param x1 Pointer to store the top-left corner x coord of the bounding box
 * @param y1 Pointer to store the top-left corner y coord of the bounding box
 * @param w Pointer to store the width of the bounding box
 * @param h Pointer to store the height of the bounding box
 */
void Display_getTextBounds(const char *string, int16_t x, int16_t y, int16_t *x1, int16_t *y1, uint16_t *w, uint16_t *h);

/**
 * @brief Function to set the text size for the display
 * 
 * @param sx Horizontal size
 * @param sy Vertical size
 */
void Display_setTextSize(uint8_t sx, uint8_t sy);

/**
 * @brief Function to set the font for the display
 * 
 * @param f Pointer to the font to set. Fonts are defined in header files stored in Core/Inc/graphics/Fonts.
 */
void Display_setFont(const GFXfont *f);

/**
 * @brief Sets the cursor position for the display. The cursor is used as the starting point for drawing text. Singleton function that does not call setAddrWindow
 * 
 * @param x x coord of the cursor
 * @param y y coord of the cursor
 */
void Display_setCursor(int16_t x, int16_t y);

/**
 * @brief Sets the color used to draw text on the display
 * 
 * @param c Color to set the text to
 */
void Display_setTextColor(uint16_t c);

/**
 * @brief Sets the text color and background color behind the characters
 * 
 * @param c Color to draw the text in
 * @param bg Color to draw behind the text
 */
void Display_setTextColorWithBg(uint16_t c, uint16_t bg);

/**
 * @brief Sets whether text should wrap when it reaches the edge of the display
 * 
 * @param w true to enable text wrapping, false to clip text at the edge of the display
 */
void Display_setTextWrap(bool w);

/**
 * @brief Sets whether to use the CP437 character set. If false, will use standard ASCII. If true, will use CP437 which has some additional characters in the 128-255 range. Singleton function that does not call setAddrWindow
 * 
 * @param x true to enable CP437 character set, false to use standard ASCII
 */
void Display_cp437(bool x);

/**
 * @brief Get the width of the initialized display. Adjusts based on the current rotation of the display
 * 
 * @return int16_t width of display
 */
int16_t Display_width();

/**
 * @brief Get the height of the initialized display. Adjusts based on the current rotation of the display
 * 
 * @return int16_t height of display
 */
int16_t Display_height();

/**
 * @brief Get the current rotation of the display
 * 
 * @return uint8_t rotation of display (0-3 corresponding to 0, 90, 180, and 270 degrees)
 */
uint8_t Display_getRotation();

/**
 * @brief Gets the current x coord of the display's cursor
 * 
 * @return int16_t the current x coord of the display's cursor
 */
int16_t Display_getCursorX();

/**
 * @brief Gets the current y coord of the display's cursor
 * 
 * @return int16_t the current y coord of the display's cursor
 */
int16_t Display_getCursorY();

/**
 * @brief Print a string of text to the display
 * 
 * @param str Pointer to the string of text to print
 */
void Display_print(const char *str);

/**
 * @brief Print a string of text to the display followed by a newline
 * 
 * @param str Pointer to the string of text to print
 */
void Display_println(const char *str);

#ifdef __cplusplus
}
#endif // __cplusplus

#endif // ADAFRUIT_ST7735_API_H